{
  "company": [
    {
      "title": "Developer Experience Engineer",
      "time": "June 2021 - April 2023",
      "companyName": "3Box Labs",
      "details": [
        "Architected, developed and implemented developer tooling that increased new technology adoption by 200%.",
        "Led bi-weekly community feedback and coaching sessions, providing community support while collecting and distilling feedback that ensured features that enabled developer success were prioritized.",
        "Developed comprehensive technical specifications that identified project objectives and implementations, enabling cross-team feedback and alignment on feature development.",
        "Coordinated with product development to establish clear and referencable documentation, resulting in 50% fewer community support requests."
      ]
    },
    {
      "title": "Full-Stack Engineer",
      "time": "November 2020 - June 2021",
      "companyName": "tilr",
      "details": [
        "Developed a resumé parsing service that processed user-uploaded resumes 90% faster and 50% more accurately than previous iterations.",
        "Designed and implemented an API gateway that reduced external API calls by 30%.",
        "Implemented an event-driven caching mechanism that reduced server load by 20% and improved API response time by 80%.",
        "Collaborated with in-house designers to ensure designs were achievable and executed without compromise."
      ]
    },
    {
      "title": "Full-Stack Engineer",
      "time": "March 2020 - July 2020",
      "companyName": "NorthOne",
      "details": [
        "Coached and assisted engineers in developing and executing their ideas for new product features.",
        "Coordinated with organization-wide, language-specific teams to establish best practices, identify potential design flaws and minimize avoidable downtime.",
        "Developed unopinionated solutions that enabled error standardization, handling and logging by leveraging AWS X-Ray.",
        "Designed flexible API services that enabled external service integrations."
      ]
    },
    {
      "title": "Full-Stack Engineer",
      "time": "July 2019 - November 2019",
      "companyName": "Magnifi",
      "details": [
        "Supported junior and intermediate developers through feature creation and implementation.",
        "Coordinated transition from Embedded Ruby templates to a tailormade React front-end.",
        "Implemented an Agile framework that mitigated developer burnout and increased leadership’s visibility into available developer capacity."
      ]
    }
  ]
}
